from flask import Flask, request, jsonify, make_response
from flask_pymongo import PyMongo

app = Flask(__name__)

app.config['MONGO_DBNAME'] = 'phonetoque'  # mettre le nom de la bd
app.config[
    'MONGO_URI'] = 'mongodb://joseph:password@ds135866.mlab.com:35866/phonetoque'  # mettre le lien de la db avec username et password
app.config['JSON_AS_ASCII'] = False

mongo = PyMongo(app)


phonem_list_old = ["m̥","m","ɱ","n̼","n̥","n","ɳ̊","ɳ","ɲ̊","ɲ","ŋ̊","ŋ","ɴ","p","b","p̪","b̪","t̼","d̼","t","d","ʈ","ɖ","c","ɟ","k","ɡ","q","ɢ","ʡ",
               "ʔ","s","z","ʃ","ʒ","ʂ","ʐ","ɕ","ʑ","ɸ","β","f","v","θ̼", "ð̼","θ","ð","θ̠","ð̠","ɹ̠̊","ɹ̠","ɻ","ç","ʝ","x","ɣ","χ",
               "ʁ","ħ","ʕ","ʢ","h","ɦ","ʋ̥","ʋ","ɹ̥","ɹ","ɻ̊","ɻ","j̊","j","ɰ̊","ɰ","ʔ̞","ⱱ̟","ⱱ","ɾ̼", "ɾ̥","ɾ","ɽ̊","ɽ","ɢ̆","ʡ̮","ʙ̥",
               "ʙ","r̼","r̥","r","ɽ̊","ɽ","ʀ̥","ʀ","ʜ","ʢ","ɬ","ɮ","ɭ̊","ʎ̥˔","ʎ̝","ʟ̝̊","ʟ̝","l̥","l","ɭ̊","ɭ","ʎ̥","ʎ","ʟ̥","ʟ","ʟ̠","ɺ","ɺ̢",
               "ʎ̮","ʟ̆","m̥","m","p","b","ɸ","β","ⱱ̟","ʙ̥","ʙ","ɱ","p̪","b̪","f","v","ʋ̥","ʋ","ⱱ","n̼","t̼","d̼","θ̼","ð̼","ɾ̼","r̼","n̥","n",
               "t","d","s","z","θ̠","ð̠","ɹ̥","ɹ","ɾ̥","ɾ","r̥","r","ɬ","ɮ","l̥","l","ɺ","t","d","θ","ð","ʃ","ʒ","ɹ̠̊˔","ɹ̠˔","ɳ̊","ɳ",
               "ʈ","ɖ","ʂ","ʐ","ɻ˔","ɻ̊","ɻ","ɽ̊","ɽ","ɭ̊˔","ɭ̊","ɭ","ɺ̢","ɲ̊","ɲ","c","ɟ","ɕ","ʑ","ç","ʝ","j̊","j","ʎ̥˔","ʎ̝","ʎ̥","ʎ","ʎ̮",
               "ŋ̊","ŋ","k","ɡ","x","ɣ","ɰ̊","ɰ","ʟ̝̊","ʟ̝","ʟ̥","ʟ","ʟ̆","ɴ","q","ɢ","χ","ʁ","ɢ̆","ʀ̥","ʀ","ʟ̠","ħ","ʕ","ʡ","ʢ","ʡ̮","ʜ","ʢ",
               "ʔ","h","ɦ","ʔ̞","m̥","n̥","ɳ̊","ɲ̊","ŋ̊","p","p̪","t̼","t","ʈ","c","k","q","ʡ","ʔ","s","ʃ","ʂ","ɕ","ɸ","f","θ̼","θ","θ̠",
               "ɹ̠̊˔","ç","x","χ","ħ","h","ʋ̥","ɹ̥","ɻ̊","j̊","ɰ̊","ɾ̥","ɽ̊","ʙ̥","r̥","ʀ̥","ʜ","ɬ","ɭ̊˔","ʎ̥˔","ʟ̝̊","l̥","ɭ̊","ʎ̥","ʟ̥","m","ɱ","n̼",
               "n","ɳ","ɲ","ŋ","ɴ","b","b̪","d̼","d","ɖ","ɟ","ɡ","ɢ","z","ʒ","ʐ","ʑ","β","v","ð̼","ð","ð̠","ɹ̠˔","ɻ˔","ʝ","ɣ","ʁ","ʕ",
               "ʢ","ɦ","ʋ","ɹ","ɻ","j","ɰ","ʔ̞","ⱱ̟","ⱱ","ɾ̼","ɾ","ɽ","ɢ̆","ʡ̮","ʙ","r̼","r","ʀ","ʢ","ɮ","ʎ̝","ʟ̝","l","ɭ","ʎ","ʟ","ʟ̠",
               "ɺ","ɺ̢","ʎ̮","ʟ̆","χ","ʁ","r̥","r","ɹ̥","ɹ","ʀ̥","ʀ","w","ɥ",
               "i","y","ɨ","ʉ","ɯ","u","ɪ","ʏ","ɪ̈","ʊ̈","ɯ̽","ʊ","e","ø","ɘ","ǝ","ɵ","ɤ","o","e̞","ø̞","ə","ɵ̞","ɤ̞","o̞","ɛ","œ","ɜ",
               "ɞ","ʌ","ɔ","æ","ɐ","ɞ̞","a","ɶ","ä","ɒ̈","ɑ","ɒ"]

phonem_list = ['ɾ', 'ə', 'ɾ̥', 'ɻ̊', 'ɑ', 'ɕ', 'n̼', 'ʕ', 'ɟ', 'ɲ', 'ɵ̞', 'ɡ', 'ɪ̈', 'ʊ̈', 'l̥', 'ɐ', 'æ', 'ʜ', 'l', 'ɵ', 'ɔ', 'ʟ̝̊', 'ɜ',
               'ɦ', 'ø', 'ʉ', 'ʢ', 'ŋ̊', 'ʀ', 'ʙ̥', 'ⱱ', 'q', 'ç', 'ʎ', 'ʒ', 'ʌ', 'ä', 'b', 'ʔ', 'ɹ̥', 'ɪ', 'ɴ', 'e', 'ɞ', 'ɒ', 'ɥ',
               'a', 'ɢ̆', 's', 'ø̞', 'ʊ', 'n', 'm̥', 'k', 'χ', 'd̼', 'ɢ', 'ʃ', 'ʋ', 'ɰ', 'ɾ̼', 'œ', 'ɹ̠˔', 'ɹ̠̊˔', 'ǝ', 'ð', 'ħ', 'w', 'j',
               'ɳ̊', 'o̞', 'ŋ', 'ʡ̮', 'θ', 'ʔ̞', 'e̞', 'ⱱ̟', 'ɞ̞', 'ɖ', 'p̪', 'o', 'ɤ̞', 'ʟ̝', 'ʟ̥', 'ʎ̮', 'r', 'θ̼', 'ʋ̥', 'ʡ', 'ɬ', 'ʑ', 'θ̠', 'm',
               'j̊', 'ʐ', 'β', 'ɒ̈', 'ɭ', 'ʎ̝', 'ɘ', 'ɳ', 'ð̠', 'ʏ', 'ɽ̊', 'ʝ', 'ʎ̥˔', 'ɹ̠̊', 'p', 'c', 'f', 'x', 'ʟ', 'ʈ', 'ɻ˔', 't̼', 'ɭ̊',
               'ʙ', 'ɯ', 'ɭ̊˔', 'i', 'ʂ', 'z', 'ɨ', 'v', 'ɰ̊', 'y', 'ɶ', 'r̼', 't', 'ɺ̢', 'ʟ̠', 'ɤ', 'ɮ', 'b̪', 'ɲ̊', 'ʁ', 'r̥', 'ɯ̽', 'ɱ',
               'ʎ̥', 'ɛ', 'ɸ', 'ɹ̠', 'u', 'ɻ', 'ɣ', 'ɹ', 'h', 'ɺ', 'd', 'ʀ̥', 'ʟ̆', 'n̥', 'ɽ', 'ð̼']
# 155 phonems listed

#correspondance entre un phonème et son écriture probable en français :
corres = {'m': 'e', 'n': 'n', 'ɲ': 'n', 'ŋ': 'n', 'p': 'p', 'b': 'b', 't': 't', 'd': 'd', 'c': 'i', 'k': 'e', 'ɡ': 'g', 's': 's', 'z': 's', 'ʃ': 'c', 'ʒ': 'e', 'β': 'p', 'f': 'f', 'v': 'e', 'θ': 'o', 'ð': 'd', 'ç': 'i', 'x': 'e', 'ɣ': 'o', 'ʁ': 'r', 'h': 'h', 'ɹ': 'r', 'j': 'i', 'ɾ': 'a', 'r': 'r', 'ʀ': 'r', 'l': 'l', 'ɭ': 's', 'ʎ': 'l', 'w': 'o', 'ɥ': 'u', 'i': 'i', 'y': 'u', 'u': 'u', 'ɪ': 'i', 'ʊ': 'o', 'e': 'e', 'ø': 'e', 'ǝ': 'e', 'o': 'a', 'ə': 'e', 'ɛ': 'e', 'œ': 'e', 'ɜ': 'u', 'ʌ': 's', 'ɔ': 'o', 'æ': 'a', 'ɐ': 'i', 'a': 'a', 'ɑ': 'e', 'ɒ': 'l'}

corres2 = {'əf': ('ef', 31.0), 'ŋɡ': ('in', 2.0), 'bm': ('su', 2.0), 'a': ('a', 7955.0), 'ɡy': ('gu', 53.0), 'ɑs': ('as', 31.0), 'd': ('d', 3691.0), 's': ('s', 5345.0), 'er': ('ér', 3.0), 'au': ('ou', 5.0), 'jn': ('n', 1.0), 'kɜ': ('ku', 1.0), 'db': ('an', 1.0), 'ʁʁ': ('ré', 5.0), 'ad': ('ad', 319.0), 'ɪç': ('ic', 2.0), 'ɾj': ('on', 1.0), 'ɛn': ('ne', 194.0), 'œf': ('uf', 11.0), 'oz': ('os', 119.0), 'as': ('on', 665.0), 'fʀ': ('ph', 1.0), 'aa': ('ah', 3.0), 'ʒɔ': ('jo', 36.0), 'əd': ('ed', 29.0), 'af': ('af', 121.0), 'lp': ('lp', 20.0), 'ʃv': ('ch', 2.0), 'uʁ': ('ur', 344.0), 'ei': ('éi', 19.0), 'əa': ('éh', 1.0), 'vm': ('ve', 36.0), 'eʁ': ('ér', 637.0), 'uø': ('eu', 1.0), 'td': ('te', 2.0), 'sk': ('sc', 160.0), 'rø': ('eu', 1.0), 'ɾa': ('on', 1.0), 'sʁ': ('er', 16.0), 'va': ('va', 280.0), 'ov': ('au', 21.0), 'ɐ': ('i', 5.0), 'ɡn': ('gn', 4.0), 'ʁy': ('ru', 201.0), 'dz': ('ds', 1.0), 'ɥɑ': ('an', 16.0), 'ɑm': ('la', 10.0), 'əb': ('eb', 9.0), 'dɥ': ('du', 63.0), 'ry': ('ru', 2.0), 'ɛl': ('el', 407.0), 'rt': ('ve', 1.0), 'bʁ': ('br', 307.0), 'ʁa': ('ra', 1199.0), 'h': ('h', 16.0), 'zo': ('se', 7.0), 'nk': ('in', 2.0), 'lv': ('lv', 24.0), 'ɔɔ': ('oo', 11.0), 'vn': ('ve', 17.0), 'bd': ('bd', 8.0), 'ǝb': ('re', 4.0), 'jø': ('eu', 112.0), 'ba': ('ba', 334.0), 'ɛɲ': ('gn', 43.0), 'ɔv': ('ov', 72.0), 'ɑn': ('ne', 10.0), 'ʃɛ': ('ch', 92.0), 'ʃɐ': ('fi', 1.0), 'ŋʁ': ('li', 1.0), 'hu': ('ou', 1.0), 'iz': ('is', 538.0), 'ts': ('ts', 7.0), 'jɔ': ('io', 1317.0), 'vʁ': ('vr', 118.0), 'zɔ': ('so', 110.0), 'əʁ': ('er', 116.0), 'dø': ('eu', 8.0), 'əl': ('el', 124.0), 'ʃu': ('ch', 9.0), 'xa': ('vi', 1.0), 'kɹ': ('op', 1.0), 'df': ('fr', 1.0), 'oʁ': ('au', 16.0), 'ae': ('aé', 24.0), 'ʁz': ('at', 2.0), 'tə': ('te', 131.0), 'sɪ': ('ci', 1.0),
           'ɑ': ('n', 4004.0), 'np': ('np', 1.0), 'pʀ': ('pr', 2.0), 'ym': ('um', 127.0), 'kœ': ('ue', 23.0), 'pe': ('pé', 283.0), 'fu': ('fo', 64.0), 'bø': ('eu', 2.0), 'wʌ': ('on', 1.0), 'ɪə': ('m', 1.0), 'ʁf': ('rf', 34.0), 'wn': ('ou', 1.0), 'ʁd': ('rd', 234.0), 'ɔa': ('oa', 5.0), 'kr': ('r', 1.0), 'so': ('au', 49.0), 'ks': ('ex', 236.0), 'ɔe': ('co', 7.0), 'əv': ('ev', 132.0), 'nɑ': ('an', 96.0), 'rʒ': ('in', 1.0), 'kl': ('cl', 260.0), 'ai': ('aï', 19.0), 'ɑf': ('re', 2.0), 'fə': ('ai', 13.0), 'iɛ': ('an', 1.0), 'ʒɑ': ('ge', 74.0), 'rɔ': ('ro', 4.0), 'bi': ('bi', 260.0), 'iʒ': ('ig', 116.0), 'kø': ('eu', 7.0), 'pj': ('pi', 71.0), 'zu': ('so', 5.0), 'ɡɑ': ('an', 28.0), 'ʊ': ('o', 3.0), 'uŋ': ('ke', 1.0), 'ɔj': ('oy', 8.0), 'ɛv': ('ve', 37.0), 'fn': ('et', 1.0), 'ɒɹ': ('ce', 1.0), 'eɔ': ('éo', 68.0), 'wu': ('od', 2.0), 'ɣ': ('i', 2.0), 'ɔd': ('od', 149.0), 'ky': ('cu', 299.0), 'zi': ('si', 276.0), 'øz': ('eu', 88.0), 'uf': ('ou', 31.0), 'in': ('in', 710.0), 'mɛ': ('me', 161.0), 'is': ('is', 891.0), 'nb': ('nb', 2.0), 'fɡ': ('gh', 7.0), 'ɾm': ('rm', 1.0), 'pø': ('eu', 9.0), 'jə': ('vi', 1.0), 'fœ': ('eu', 14.0), 'oʃ': ('ch', 20.0), 'lø': ('eu', 25.0), 'ab': ('ab', 527.0), 'kf': ('fr', 1.0), 'ʒɪ': ('ji', 2.0), 'ʒ': ('e', 1340.0), 'km': ('me', 42.0), 'ɪʃ': ('fi', 1.0), 'ɪs': ('an', 2.0), 'kɥ': ('cu', 35.0), 'ɡʀ': ('af', 1.0), 'øl': ('eu', 2.0), 'hœ': ('eu', 1.0), 'ke': ('qu', 144.0), 'ia': ('i', 1.5), 'st': ('st', 1066.0), 'lt': ('lt', 138.0), 'ʒf': ('ag', 1.0), 'ǝd': ('re', 4.0), 'ɡɹ': ('gr', 2.0), 're': ('re', 6.0), 'ə': ('e', 1266.0), 'ep': ('ép', 307.0), 'fɛ': ('fe', 135.0), 'ii': ('hi', 3.0), 'uɣ': ('so', 1.0), 'tp': ('ep', 1.0), 'ɛɛ': ('ou', 1.0), 'ɔp': ('op', 210.0), 'ðw': ('ua', 1.0), 'ct': ('me', 1.0), 'ɡz': ('ex', 79.0), 'ʃʁ': ('er', 3.0), 'jm': ('le', 5.0), 'ow': ('ow', 1.0), 'ʒy': ('ju', 100.0), 'ns': ('n', 3.0), 'ɹd': ('ow', 1.0), 'iʁ': ('ir', 592.0), 'ɛx': ('ec', 1.0), 'ji': ('il', 31.0), 'əɛ': ('re', 1.0), 'ʁɑ': ('ra', 332.0), 'tz': ('tz', 1.0), 'um': ('ou', 21.0), 'jo': ('io', 33.0), 'ød': ('eu', 6.0), 'zɑ': ('nt', 106.0), 'nu': ('ou', 40.0), 'ty': ('tu', 329.0), 'ɲi': ('gn', 22.0), 'yø': ('eu', 1.0), 'ʃo': ('ch', 39.0), 'dɑ': ('en', 111.0), 'dœ': ('de', 32.0), 'ʊd': ('be', 1.0), 'ip': ('ip', 160.0), 'mv': ('vi', 1.0), 'eu': ('éo', 1.0), 'œ': ('u', 728.0), 'aʒ': ('ag', 404.0), 'tf': ('ef', 3.0), 'ɪæ': ('fi', 1.0), 've': ('vé', 142.0), 'ʃn': ('ei', 1.0), 'ɡ': ('g', 1232.0), 'le': ('lé', 347.0), 'ku': ('co', 186.0), 'ee': ('ré', 17.0), 'ɡw': ('go', 9.0), 'ʃk': ('ch', 3.0), 'ui': ('ou', 5.0), 'se': ('e', 243.5), 'tɾ': ('on', 1.0), 'əʃ': ('ec', 10.0), 'nɛ': ('ne', 166.0), 'lɔ': ('lo', 428.0), 'ɒθ': ('sc', 1.0), 'sa': ('sa', 247.0), 'ɔl': ('ol', 554.0), 'nə': ('ne', 28.0), 'zœ': ('eu', 9.0), 'ər': ('ei', 1.0), 'ɪn': ('ne', 4.0), 'iʎ': ('rm', 1.0), 'jd': ('er', 5.0), 'wi': ('ou', 20.0), 'aw': ('ou', 5.0), 'bɹ': ('li', 1.0), 'wɑ': ('oi', 6.0), 'nj': ('ni', 135.0), 'fy': ('fu', 78.0), 'ʃy': ('ch', 13.0), 'œp': ('eu', 7.0), 'rn': ('ou', 1.0), 'bʒ': ('bj', 12.0), 'pʌ': ('ca', 1.0), 'yz': ('us', 120.0), 'ha': ('ha', 4.0), 'ɹb': ('bi', 1.0), 'eɑ': ('éa', 30.0), 'ls': ('ls', 19.0), 'ik': ('qu', 577.0), 'of': ('au', 16.0), 'βo': ('ol', 1.0), 'uz': ('ou', 30.0), 'mu': ('ou', 51.0), 'ɲo': ('au', 2.0), 'rd': ('or', 2.0), 'iœ': ('eu', 1.0), 'du': ('ou', 52.0), 'at': ('at', 862.0), 'j': ('i', 3422.0), 'ɡə': ('en', 2.0), 'za': ('sa', 157.0), 'mə': ('me', 55.0), 'ʒo': ('jo', 6.0), 'kɔ': ('co', 1382.0), 'nv': ('iè', 1.0), 'bœ': ('eu', 4.0), 'dl': ('de', 2.0), 'ǝɡ': ('eg', 2.0), 'mœ': ('me', 37.0), 'uɡ': ('go', 3.0), 'eo': ('éo', 8.0), 'ɹɪ': ('op', 1.0), 'ʒj': ('gi', 46.0), 'yv': ('uv', 11.0), 'mʁ': ('er', 4.0), 'fɥ': ('fu', 7.0), 'ɹu': ('ou', 1.0), 'ɪz': ('ne', 1.0), 'ɔɪ': ('et', 1.0), 'ʁɲ': ('gn', 7.0), 'ms': ('am', 3.0), 'ti': ('ti', 1222.0), 'iŋ': ('in', 21.0), 'ɹə': ('ce', 1.0), 'aɪ': ('i', 4.0), 'ʁw': ('ro', 103.0), 'ue': ('ou', 2.0), 'uʃ': ('ou', 53.0), 'lo': ('lo', 59.0), 'ɒl': ('li',1.0), 'ʁø': ('eu', 54.0), 'rɑ': ('an', 1.0), 'øn': ('ne', 2.0), 'ʊə': ('ow', 1.0), 'ʁb': ('rb', 100.0), 'lu': ('lo', 50.0), 'ko': ('co', 32.0), 'ʁɡ': ('rg', 65.0), 'ɡs': ('er', 3.0), 'lǝ': ('le', 38.0), 'rp': ('pi', 1.0), 'v': ('v', 2328.0), 'oj': ('pa', 1.0), 'l': ('l', 5865.0), 'ʁm': ('rm', 321.0), 'kɑ': ('an', 77.0), 'dn': ('dn', 2.0), 'yf': ('uf', 37.0), 'kt': ('ct', 357.0), 'ɛb': ('re', 10.0), 'ɛʁ': ('er', 987.0), 'ɔm': ('om', 355.0), 'ɛʀ': ('iq', 1.0), 'ʌn': ('su', 1.0), 'aβ': ('ol', 1.0), 'ɾð': ('ua', 1.0), 'ɜ': ('u', 2.0), 'vø': ('eu', 11.0), 'ɾ': ('r', 5.0), 'ʃm': ('ch', 17.0), 'ɑj': ('il', 34.0), 'lɛ': ('l', 236.0), 'mn': ('mn', 19.0), 'ʃə': ('ch', 49.0), 'œb': ('ub', 10.0), 'ɡi': ('gu', 17.0), 'ʃj': ('ch', 14.0), 'ɔt': ('ot', 287.0), 'hɪ': ('tl', 1.0), 'yr': ('ur', 3.0), 'ʃw': ('ch', 20.0), 'aɡ': ('ag', 121.0), 'ɥa': ('ua', 41.0), 'tj': ('ti', 125.0), 'ʁk': ('rc', 73.0), 'cl': ('po', 1.0), 'ŋp': ('po', 1.0), 'uj': ('ui', 53.0), 'z': ('s', 1639.0), 'əm': ('em', 219.0), 'ɑv': ('av', 3.0), 'ɛf': ('ef', 19.0), 'ɹt': ('ku', 1.0), 'ɡʒ': ('su', 8.0), 'kw': ('qu', 17.0), 'iɔ': ('io', 2.0), 'ɑd': ('dr', 2.0), 'ch': ('ha', 1.0), 'ɡɛ': ('gu', 21.0), 'tt': ('et', 2.0), 'ub': ('ub', 34.0), 'kd': ('an', 2.0), 'jl': ('aï', 3.0), 'ps': ('bs', 61.0), 'tɡ': ('tt', 1.0), 'lw': ('lo', 77.0), 'eɛ': ('ée', 26.0), 'ʁv': ('rv', 151.0), 'ta': ('ta', 703.0), 'nt': ('n', 6.5), 'sm': ('me', 215.0), 'hɔ': ('rn', 1.0), 'ɪt': ('it', 4.0), 'ʁo': ('ro', 82.0), 'vk': ('œu', 1.0), 'yɑ': ('lu', 11.0), 'rʁ': ('me', 1.0), 'øk': ('eu', 1.0), 'fw': ('fo', 20.0), 'ul': ('ul', 123.0), 'eɲ': ('gn', 4.0), 'uk': ('ou', 18.0), 'ka': ('ca', 647.0), 'zp': ('so', 1.0), 'kʁ': ('cr', 396.0), 'yt': ('ut', 158.0), 'ft': ('e', 2.5), 'lʁ': ('er', 16.0), 'ɜɹ': ('ku', 1.0), 'sv': ('sv', 3.0), 'ʁœ': ('eu', 27.0), 'la': ('la', 489.0), 'ɔ': ('o', 6470.0), 'fr': ('re', 2.0), 'aʀ': ('ma', 1.0), 'aɛ': ('a', 3.5), 'bɑ': ('ba', 66.0), 'vo': ('au', 21.0), 'wt': ('ou', 2.0), 'ny': ('nu', 165.0), 'zø': ('eu', 6.0), 'ʌs': ('ca', 1.0), 'aʊ': ('ow', 2.0), 'lɒ': ('ce', 1.0), 'do': ('do', 18.0), 'øs': ('eu', 1.0), 'al': ('al', 1222.0), 'ǝk': ('ec', 11.0), 'mɑ': ('me', 914.0), 'yɲ': ('ép', 3.0), 'wɔ': ('qu', 1.0), 'pt': ('pt', 95.0), 'ɛm': ('me', 67.0), 'pl': ('pl', 397.0), 'ʀa': ('af', 1.0), 'tɔ': ('to', 294.0), 'ɲ': ('n', 257.0), 'zn': ('ne', 6.0), 'ɲɔ': ('no', 27.0), 'ɾi': ('ca', 1.0), 'ri': ('ri', 4.0), 'tr': ('tr', 5.0), 'ʀɛ': ('ai', 2.0), 'ɔʁ': ('or', 1059.0), 'əz': ('es', 21.0), 'ɛɡ': ('ex', 78.0), 'sɛ': ('e', 217.0), 'yn': ('un', 154.0), 'ɛs': ('es', 538.0), 'ʀɔ': ('op', 2.0), 'we': ('ou', 33.0), 'tʃ': ('ch', 28.0), 'ʒɥ': ('ju', 8.0), 'oʒ': ('ge', 5.0), 'ol': ('l', 26.0), 'ɣo': ('eg', 1.0), 'dʃ': ('ez', 1.0), 'te': ('té', 865.0), 'ɑp': ('âp', 3.0), 'zə': ('ra', 4.0), 'œɡ': ('eu', 4.0), 'yʃ': ('ch', 16.0), 'rɒ': ('sc', 1.0), 'my': ('mu', 155.0), 'eʒ': ('ég', 85.0), 'sɑ': ('nt', 190.0), 'ç': ('h', 2.0), 'iɡ': ('ig', 114.0), 'na': ('na', 459.0), 'œʁ': ('ur', 569.0), 'ɲe': ('gn', 63.0), 'ʁǝ': ('re', 96.0), 'ʁe': ('ré', 1102.0), 'ru': ('er', 2.0), 'me': ('mé', 324.0), 'ɔs': ('os', 149.0), 'oɡ': ('ug', 12.0), 'ʃœ': ('ch', 12.0), 'k': ('c', 4150.0), 'fl': ('fl', 145.0), 'ɥs': ('io', 1.0), 'aŋ': ('n', 1.0), 'ɪd': ('ne', 2.0), 'ɛt': ('te', 252.0), 'ʒi': ('gi', 260.0), 'ʁə': ('re', 523.0), 'yd': ('ud', 89.0), 'ɛ': ('e', 5341.0), 'ɥɛ': ('ue', 78.0), 'jt': ('le', 4.0), 'vɡ': ('eg', 2.0), 'ev': ('év', 208.0), 'vy': ('vu', 40.0), 'ʃɜ': ('ll', 1.0), 'ət': ('et', 88.0), 'hæ': ('ha', 3.0), 'ʒø': ('eu', 14.0), 'ɲə': ('ne', 5.0), 'c': ('e', 4.0), 'pu': ('po', 102.0), 'β': ('p', 1.0), 'ɔw': ('ow', 1.0), 'ya': ('ua', 5.0), 'p': ('p', 4295.0), 'ɜt': ('ll', 1.0), 'ɹe': ('ah', 1.0), 'n': ('n', 3508.0), 'rɛ': ('pr', 1.0), 'lɡ': ('lg', 16.0), 'kk': ('u', 1.0), 'yb': ('ub', 93.0), 'vɑ': ('nt', 118.0), 'ŋk': ('ke', 1.0), 'lʃ': ('al', 2.0), 'bz': ('su', 4.0), 'ff': ('op', 1.0), 'da': ('da', 160.0), 'ɔʃ': ('ch', 71.0), 'ŋn': ('ag', 1.0), 'ɛʒ': ('ge', 19.0), 'ju': ('ou', 9.0), 'av': ('av', 299.0), 'ɲɛ': ('gn', 8.0), 'ǝp': ('re', 14.0), 'nn': ('nn', 2.0), 'jf': ('if', 1.0), 'vj': ('vi', 134.0), 'ob': ('au', 12.0), 'nɔ': ('no', 289.0), 'li': ('li', 988.0), 'fʁ': ('fr', 248.0), 'œj': ('il', 40.0), 'dʒ': ('a', 18.5), 'ey': ('éu', 22.0), 'ki': ('qu', 107.0), 'zj': ('si', 92.0), 'rl': ('ka', 1.0), 'sø': ('eu', 13.0), 'on': ('on', 24.0), 'ʃɑ': ('ch', 103.0), 'de': ('dé', 942.0), 'ɥɔ': ('uo', 4.0), 'pa': ('pa', 630.0), 'ɡu': ('go', 43.0), 'mm': ('en', 8.0), 'ɥ': ('u', 533.0), 'en': ('én', 218.0), 'ʁs': ('er', 187.0), 'eð': ('ua', 1.0), 'ap': ('ap', 363.0), 'ǝn': ('re', 13.0), 'iʃ': ('ch', 59.0), 'ay': ('ah', 2.0), 'æm': ('ca', 1.0), 'oe': ('on', 1.0), 'or': ('ri', 1.0), 'az': ('is', 76.0), 'vœ': ('ve', 22.0), 'æl': ('al', 2.0), 'vw': ('vo', 105.0), 'lb': ('lb', 19.0), 'dʁ': ('dr', 221.0), 'ɹi': ('ry', 2.0), 'ɔb': ('ob', 133.0), 'əɡ': ('eg', 28.0), 'ǝs': ('re', 4.0), 'ak': ('ac', 428.0), 'jy': ('iu', 5.0), 'ro': ('ro', 4.0), 'ly': ('lu', 230.0), 'bɛ': ('be', 89.0), 'œv': ('uv', 23.0), 'ɡɔ': ('go', 93.0), 'ǝf': ('ef', 5.0), 'f': ('f', 2116.0), 'vɛ': ('ve', 254.0), 'eɣ': ('eg', 1.0), 'zɪ': ('si', 1.0), 'eɾ': ('er', 3.0), 'ɲm': ('gn', 6.0), 'ɲɑ': ('an', 23.0), 'sɥ': ('su', 68.0), 'pɔ': ('po', 477.0), 'ǝʁ': ('er', 4.0), 'ɡl': ('gl', 100.0), 'və': ('ve', 70.0), 'ɡj': ('py', 1.0), 'jɛ': ('ie', 395.0), 'ne': ('né', 346.0), 'ed': ('éd', 216.0), 'oɐ': ('vi', 1.0), 'ɭ': ('u', 1.0), 'od': ('au', 38.0), 'øt': ('eu', 13.0), 'øʁ': ('eu', 14.0), 'ʁl': ('rl', 58.0), 'fɔ': ('fo', 242.0), 'o': ('a', 701.0), 'iɐ': ('i', 1.0), 'i': ('i', 7753.0), 'es': ('éc', 148.0), 'jʃ': ('or', 1.0), 'zb': ('is', 3.0), 'ʊk': ('hs', 1.0), 'su': ('so', 163.0), 'ao': ('ao', 4.0), 'ʀy': ('pr', 1.0), 'ɪp': ('ph', 1.0), 'əʒ': ('re', 23.0), 'tø': ('eu', 18.0), 'mj': ('mi', 42.0), 'ɔɡ': ('og', 100.0), 'm': ('m', 4112.0), 'ni': ('ni', 568.0), 'lz': ('al', 6.0), 'dɪ': ('di', 2.0), 'th': ('et', 1.0), 'ʌ': ('u', 3.0), 'b': ('b', 2511.0), 'fo': ('au', 25.0), 'ho': ('et', 1.0), 'ʁɔ': ('ro', 789.0), 'aɲ': ('gn', 79.0), 'ɛk': ('ec', 256.0), 'pm': ('nt', 10.0), 'si': ('i', 423.0), 'ʁʃ': ('rc', 73.0), 'yo': ('au', 1.0), 'ʃɔ': ('ho', 24.0), 'be': ('bé', 98.0), 'ð': ('u', 1.0), 'ɥœ': ('eu', 4.0), 'fi': ('fi', 383.0), 'ʀɪ': ('ie', 1.0), 'ɒ': ('r', 3.0), 'eɡ': ('ég', 150.0), 'ɲy': ('ig', 2.0), 'nø': ('eu', 27.0), 'ys': ('us', 152.0), 'zɥ': ('su', 7.0), 'zy': ('su', 37.0), 'it': ('it', 1002.0), 'ʁp': ('rp', 64.0), 'fʊ': ('hs', 1.0), 'ɡd': ('ag', 1.0), 'ib': ('ib', 228.0), 'vl': ('ve', 20.0), 'ʀt': ('iq', 1.0), 'ɪk': ('i', 2.0), 't': ('t', 7452.0), 'et': ('ét', 414.0), 'vɪ': ('vi', 1.0), 'oɛ': ('o', 1.5), 'wa': ('oi', 453.0), 'ǝʃ': ('ha', 1.0), 'pɥ': ('pu', 34.0), 'sə': ('se', 68.0), 'an': ('an', 461.0), 'æ': ('a', 8.0), 'ʒə': ('ge', 26.0), 'zw': ('so', 9.0), 'vɔ': ('vo', 151.0), 'bw': ('bo', 20.0), 'bs': ('bs', 14.0), 'lk': ('lc', 19.0), 'fa': ('fa', 185.0), 'eɪ': ('a', 3.5), 'ln': ('ln', 5.0), 'ɥe': ('ué', 51.0), 'iv': ('iv', 359.0), 'vt': ('et', 5.0), 'ej': ('ei', 12.0), 'oɔ': ('ni', 1.0), 'bu': ('bo', 166.0), 'sw': ('so', 46.0), 'yp': ('up', 133.0), 'kə': ('ue', 16.0), 'x': ('e', 2.0), 'ɹ': ('r', 10.0), 'dy': ('du', 165.0), 'ld': ('ld', 19.0), 'iɑ': ('bi', 1.0), 'kb': ('bo', 2.0), 'kn': ('te', 18.0), 'lf': ('lf', 13.0), 'ɔk': ('oc', 168.0), 'ɔy': ('oh', 2.0), 'ʃi': ('ch', 106.0), 'un': ('un', 9.0), 'ɲœ': ('eu', 2.0), 'pɛ': ('pe', 273.0), 'ʃe': ('ch', 148.0), 'lœ': ('eu', 47.0), 'ʒɡ': ('eg', 1.0), 'vu': ('vo', 26.0), 'op': ('op', 23.0), 'ot': ('ut', 80.0), 'tʁ': ('tr', 1078.0), 'ɛz': ('ai', 78.0), 'pœ': ('pe', 18.0), 'ye': ('er', 5.0), 'ɣi': ('so', 1.0), 'ø': ('u', 379.0), 'bl': ('bl', 552.0), 'əɹ': ('ow', 1.0), 'zd': ('sd', 1.0), 'ʒʁ': ('an', 3.0), 'y': ('u', 2603.0), 'om': ('me', 36.0), 'ɡm': ('gm', 22.0), 'ɡv': ('on', 1.0), 'œs': ('tr', 1.0), 'æt': ('fi', 1.0), 'ɔi': ('oï', 7.0), 'kæ': ('ca', 1.0), 'id': ('id', 284.0), 'el': ('él', 273.0), 'lə': ('le', 65.0), 'tɑ': ('nt', 274.0), 'ʃɪ': ('ch', 2.0), 'ɔʒ': ('og', 109.0), 'uv': ('ou', 167.0), 'fø': ('eu', 8.0), 'ɡʁ': ('gr', 359.0), 'ɪf': ('fi', 1.0), 'lj': ('li', 186.0), 'uɭ': ('éo', 1.0), 'ʃø': ('eu', 3.0), 'sy': ('su', 345.0), 'uʒ': ('ou', 18.0), 'po': ('po', 87.0), 'ŋ': ('n', 24.0), 'dɛ': ('de', 90.0), 'əs': ('re', 40.0), 'sʒ': ('sp', 1.0), 'tl': ('at', 11.0), 'ʒa': ('ja', 50.0), 'mø': ('eu', 10.0), 'ut': ('ut', 121.0), 'əe': ('su', 2.0), 'ʒw': ('jo', 42.0), 'll': ('ll', 9.0), 'ŋt': ('gt', 1.0), 'nʁ': ('ne', 15.0), 'ʒɛ': ('e', 54.5), 'ʁʒ': ('rg', 133.0), 'nœ': ('eu', 40.0), 'zm': ('se', 33.0), 'oi': ('ei', 1.0), 'eʃ': ('ch', 79.0), 'mi': ('mi', 551.0), 'jɑ': ('nt', 110.0), 'tm': ('me', 45.0), 'ur': ('ou', 1.0), 'dɔ': ('do', 204.0), 'ʁi': ('ri', 1232.0), 'us': ('ou', 83.0), 'to': ('au', 56.0), 'ɔr': ('or', 4.0), 'nw': ('no', 33.0), 'ʁɥ': ('ru', 30.0), 'œl': ('eu', 11.0), 'ɲa': ('na', 31.0), 'ɔn': ('on', 677.0), 'dj': ('di', 155.0), 'ud': ('ou', 38.0), 'ɔɲ': ('og', 16.0), 'ze': ('is', 188.0), 'sœ': ('eu', 41.0), 'ɛp': ('ep', 59.0), 'hy': ('me', 1.0), 'ss': ('so', 2.0), 'ɡb': ('ug', 1.0), 'dɡ': ('dg', 1.0), 'ʁ': ('r', 10850.0), 'aɾ': ('ar', 2.0), 'up': ('ou', 78.0), 'u': ('o', 1371.0),
           'ɡo': ('go', 23.0), 'ʀ': ('r', 11.0), 'br': ('fr', 1.0), 'ɑʃ': ('âc', 14.0), 'ea': ('éa', 82.0), 'ɑb': ('bl', 9.0), 'aʃ': ('ch', 104.0), 'œn': ('un', 7.0), 'ɔz': ('os', 79.0), 'ɔf': ('of', 69.0), 'tʀ': ('tr', 2.0), 'ɛj': ('ei', 73.0), 'ɑt': ('ât', 42.0), 'kj': ('qu', 23.0), 'øf': ('eu', 1.0), 'pn': ('pn', 5.0), 'ʎ': ('u', 1.0), 'io': ('si', 2.0), 'pʁ': ('pr', 932.0), 'iw': ('ol', 1.0), 'ɡǝ': ('ma', 1.0), 'ʁt': ('rt', 479.0), 'wɛ': ('in', 57.0), 'ʃp': ('oc', 1.0), 'ǝl': ('re', 11.0), 'bj': ('bi', 49.0), 'ən': ('en', 205.0), 'jœ': ('eu', 56.0), 'ʃ': ('h', 949.0), 'sɒ': ('li', 1.0), 'lɥ': ('lu', 35.0), 'ja': ('ia', 276.0), 'e': ('é', 5783.0), 'fk': ('ka', 1.0), 'nɪ': ('ne', 2.0), 'əp': ('ep', 79.0), 'ɡɥ': ('gu', 13.0), 'bə': ('be', 9.0), 'di': ('di', 704.0), 'ɲw': ('ig', 2.0), 'yi': ('in', 1.0), 'ez': ('és', 265.0), 'jʁ': ('ie', 2.0), 'fj': ('fi', 103.0), 'lm': ('me', 87.0), 'ɲø': ('eu', 6.0), 'θ': ('o', 2.0), 'ɑɹ': ('bi', 1.0), 'ʌu': ('éo', 1.0), 'nz': ('nz', 2.0), 'sj': ('on', 1114.0), 'ɛʃ': ('ch', 30.0), 'ɛi': ('pa', 3.0), 'pi': ('pi', 241.0), 'ʊt': ('oa', 1.0), 'ɪm': ('im', 3.0), 'ɑl': ('âl', 12.0), 'ɡe': ('gu', 30.0), 'tɥ': ('tu', 137.0), 'py': ('pu', 152.0), 'ðo': ('ua', 1.0), 'nɥ': ('nu', 46.0), 'fɑ': ('an', 27.0), 'ma': ('ma', 670.0), 'ɛc': ('me', 1.0), 'ɥø': ('eu', 20.0), 'əʊ': ('oa', 1.0), 'yʒ': ('ug', 22.0), 'wœ': ('eu', 3.0), 'pw': ('po', 46.0), 'ʁj': ('ri', 223.0), 'uɛ': ('pr', 1.0), 'ʁu': ('ro', 179.0), 'aɔ': ('ao', 9.0), 'sb': ('sb', 4.0), 'bɥ': ('bu', 19.0), 'lɑ': ('la', 207.0), 'il': ('il', 477.0), 'if': ('if', 387.0), 'bk': ('ci', 1.0), 'ɥo': ('uo', 3.0), 'sɡ': ('sg', 4.0), 'fe': ('fé', 98.0), 'ʁn': ('rn', 232.0), 'ɛd': ('de', 29.0), 'ok': ('oc', 18.0), 'sl': ('sl', 26.0), 'pə': ('pe', 45.0), 'ʃt': ('ch', 11.0), 'mo': ('mo', 19.0), 'rk': ('rc', 2.0), 'sʌ': ('u', 1.0), 'dv': ('ad', 6.0), 'ml': ('l', 2.0), 'ʎe': ('rm', 1.0), 'əɔ': ('eh', 2.0), 'ar': ('ar', 9.0), 'uʀ': ('mb', 1.0), 'sp': ('sp', 289.0), 'ʒl': ('ge', 3.0), 'ʒœ': ('eu', 19.0), 'ǝm': ('em', 49.0), 'eθ': ('go', 1.0), 'kɛ': ('qu', 88.0), 'lʒ': ('lg', 19.0), 'ek': ('éc', 302.0), 'yl': ('ul', 373.0), 'iə': ('iu', 1.0), 'ɡœ': ('ue', 12.0), 'lɐ': ('tl', 1.0), 'rɪ': ('ic', 1.0), 'yk': ('uc', 97.0), 'im': ('im', 366.0), 'dǝ': ('de', 3.0), 'jk': ('ka', 1.0), 'am': ('am', 328.0), 'ɡk': ('gk', 2.0), 'zɛ': ('se', 48.0), 'dw': ('do', 25.0), 'bv': ('su', 3.0), 'yɡ': ('ug', 22.0), 'nd': ('nd', 12.0), 'by': ('bu', 107.0), 'tu': ('ou', 106.0), 'ɪl': ('il', 3.0), 'aj': ('oy', 111.0), 'ɡʊ': ('be', 1.0), 'yɛ': ('ue', 4.0), 'ǝ': ('e', 138.0), 'zʁ': ('ie', 7.0), 'vd': ('pl', 1.0), 'no': ('au', 32.0), 'nm': ('ne', 42.0), 'fɪ': ('fi', 2.0), 'mt': ('ci', 1.0), 'sn': ('sn', 4.0), 'bæ': ('ck', 1.0), 'ɛr': ('er', 4.0), 'vi': ('vi', 382.0), 'oa': ('oa', 5.0), 'os': ('au', 36.0), 'də': ('de', 114.0), 'bɔ': ('bo', 178.0), 'tw': ('to', 82.0), 'ɑʒ': ('âg', 4.0), 'mp': ('mp', 2.0), 'ɥi': ('ui', 241.0), 'tb': ('tb', 5.0), 'rə': ('re', 3.0), 'ɡø': ('eu', 5.0), 'nl': ('an', 1.0), 'tɛ': ('te', 341.0), 'mw': ('mo', 47.0), 'ʁɛ': ('re', 389.0), 'sf': ('sf', 26.0), 'uɑ': ('ai', 1.0), 'ic': ('po', 1.0), 'w': ('o', 768.0), 'je': ('er', 480.0), 'æɹ': ('ha', 2.0), 'dm': ('ad', 26.0), 'ɑʁ': ('ar', 6.0), 'bo': ('au', 29.0), 'ɔɛ': ('o', 7.5), 'yʁ': ('ur', 536.0), 'æv': ('ha', 1.0), 'bɪ': ('be', 1.0), 'kʃ': ('ic', 1.0), 'dk': ('dk', 1.0), 'ew': ('ew', 1.0), 'eb': ('éb', 103.0), 'mɔ': ('mo', 360.0), 'ef': ('éf', 155.0), 'lɪ': ('ph', 1.0), 'r': ('r', 59.0), 'pr': ('pr', 4.0), 'ǝt': ('et', 7.0), 'tn': ('en', 32.0), 'tœ': ('te', 239.0), 'rj': ('ér', 1.0), 'ʀi': ('vi', 1.0), 'mɥ': ('mu', 7.0), 'θs': ('sc', 1.0), 'øʒ': ('eu', 2.0), 'ʒu': ('ou', 38.0), 'zt': ('ie', 2.0), 'ɑk': ('cl', 4.0), 'ɑz': ('as', 12.0), 'iɲ': ('gn', 102.0), 'ij': ('i', 121.5), 'ǝv': ('re', 11.0), 'pɑ': ('en', 88.0), 'zl': ('ty', 1.0), 'em': ('ém', 261.0), 'ʒm': ('me', 21.0), 'ɪ': ('i', 28.0), 'ʒe': ('gé', 196.0), 'øm': ('eu', 2.0), 'ds': ('de', 4.0), 'ua': ('ou', 1.0), 'ws': ('ou', 1.0), 'ʃa': ('ha', 121.0), 'ʃl': ('ch', 5.0), 'ək': ('ec', 78.0), 'mb': ('mb', 2.0), 'æk': ('ck', 1.0), 'ɡa': ('ga', 256.0), 'sɔ': ('so', 258.0), 'jw': ('ai', 2.0), 'œz': ('uz', 1.0), 'aʁ': ('ar', 1332.0), 'ra': ('ra', 5.0)}

def split_pron(pronunciation):
    list = []
    phonem = pronunciation[0]
    for character in pronunciation[1:]:
        if character in phonem_list:
            list += [phonem]
            phonem = ""
        phonem =str(phonem + character)
    list+= [phonem]
    return list


def split_word(word):
    list = []
    for letter in word:
        list += letter
    return list


def get_possible_writing_one(list_of_words,phonem):
    result = {}
    max = 0
    for word in list_of_words:
        phonems = split_pron(word[0])
        letters = split_word(word[1])
        if phonem in phonems:
            for letter in letters:
                try:
                    result[letter] += 1
                    #if result[letter] > max:
                    #    max += 1
                except KeyError:
                    result[letter] = 1
    #return result
    write = ""
    for key in result.keys():
        if result[key] > max:
            write = key
            max = result[key]
    return write


def get_possible_writing(list_of_words,phonem):
    result = {}
    max = 0
    for word in list_of_words:
        if phonem in word[0]:
            for letters in combinations(word[1]):
                score = 1-abs(len(letters)-len(phonem))/2
                try:
                    result[letters] += score
                    # if result[letter] > max:
                    #    max += 1
                except KeyError:
                    result[letters] = score
    # return result
    write = ""
    for key in result.keys():
        if result[key] > max:
            write = key
            max = result[key]
    return write, max


def combinations(word): #pour l'instant des combis de deux lettres
    a = word[0]
    list = [a]
    for letter in word[1:]:
        list += letter
        list += [a+letter]
        a = letter
    return set(list)


def get_possible_phonems(phonems): # pour l'instant des combis de deux phonèmes
    result = []
    for phonem in phonems:
        result += phonem
        for phonem2 in phonems:
            result += [phonem + phonem2]
    return set(result)


def get_collection(language):
    # on se place dans la collection correspondant à la langue choisie
    if language == 'english':
        collection = mongo.db.english_words
    elif language == 'french':
        collection = mongo.db.french_words
    elif language == 'italian':
        collection = mongo.db.italian_words
    else:
        collection = None
    return collection
    #return mongo.db.test_valentin


@app.route('/correspondance/<language>/')
def get_p_w(language):
    french_words_coll = get_collection(language).find()
    french_words = []
    for document in french_words_coll:
        word = [document['spelling_ipa'], document['spelling']]
        french_words += [word]
    dic = {}
    possible_phon = get_possible_phonems(phonem_list)
    for phonem in possible_phon:
        writing = get_possible_writing(french_words,phonem)
        if writing[0] != "":
            dic[phonem] = writing
            print(phonem,writing)
    print(dic)
    return str(dic)


"""" Pour avoir la corres pour un phonem une lettre :
def get_p_w(language):
    french_words_coll = get_collection(language).find()
    french_words = []
    for document in french_words_coll:
        word = [document['spelling_ipa'], document['spelling']]
        french_words += [word]
    dic = {}
    for phonem in phonem_list:
        writing = get_possible_writing_one(french_words, phonem)
        if writing != "":
            dic[phonem] = writing
            print(phonem,writing)
    print(dic)
    return str(dic)
"""


@app.route('/translit/<word>/')
def translitterate(word):
    english = get_collection('english').find_one({'spelling': word})['spelling_ipa']
    french = ""
    score = 0
    for parts in cut(english):
        new_score = 0
        new_french = ""
        for bit in parts:
            try:
                new_score += corres2[bit][1]
                new_french += corres2[bit][0]
            except KeyError:
                new_french += '%'
        if new_score > score:
            score = new_score
            french = new_french
    return french, score


def cut(word):
    list = []
    for i in range(2 ** (len(word) - 1)):

        # current partition, e.g., [['a', 'b'], ['c', 'd', 'e']]
        partition = []

        # used to accumulate the subsets, e.g., ['a', 'b']
        subset = ""

        for position in range(len(word)):

            subset += word[position]
            # check whether to "break off" a new subset
            if 1 << position & i or position == len(word) - 1:
                partition.append(subset)
                subset = ""
        list.append(partition)
    return list

"""" Pour corres
    english = get_collection('english').find_one({'spelling':word})['spelling_ipa']
    french = ""
    for letter in english:
        try:
            french += corres[letter]
        except KeyError:
            french += "%"
    return french
"""


@app.route('/maliste/')
def maliste():
    english = get_collection('english').find()
    dic = {}
    for word in english:
        spelling = word['spelling']
        trans = translitterate(spelling)
        dic[spelling] = trans
        if trans[1] > 500:
            print(spelling, trans)
    print(dic)
    return str(dic)



if __name__ == '__main__':
    app.run(debug=True)

